Tekla.Structures.Assertion
Defines an assertion by the method it failed in and the messages it
provided.

Tekla.Structures.Assertion.#ctor(System.String,System.String,System.String)
Initializes a new instance of the Tekla.Structures.Assertion class.
message:
The message.
detailedMessage:
The detailed message.
methodName:
The method name.
ArgumentNullException

Tekla.Structures.Assertion.Message
Gets the message provided by the assertion.

Tekla.Structures.Assertion.DetailedMessage
Gets the detailed message provided by the assertion.

Tekla.Structures.Assertion.MethodName
Gets the name of the method the assertion failed in.

Tekla.Structures.Assertion.ToString
The tostring.
Returns:
The System.String.

Tekla.Structures.Assertion.Equals(System.Object)
The equals.
obj:
The obj.
Returns:
The System.Boolean.

Tekla.Structures.Assertion.GetHashCode
Gets a hash code for this instance.
Calculated as recommended at http://msdn.microsoft.com/en-us/library/system.object.gethashcode.aspx
Returns:
The System.Int32.